full_ten.yml
config:
  target: 'https://apps4.store'
  phases:
    - duration: 20
      arrivalRate: 5
      count: 10
  defaults:
    headers:
      x-my-service-auth: '98740183827100218829567'
  variables:
    appsId:
        [
          "b3ff4e3c-9d32-4615-90e2-0647ae66f595",
          "ed1d5a9b-7fd1-4213-9f3c-290f501ba578",
          "53ad363c-2cc7-48f9-973c-ba83acf8e9b2",
          "c49a71b8-5db1-4685-8cc7-f4a744869dad",
          "835592b4-aaf6-41bd-b28d-01ee7d9c7730",
          "e4ae7028-badd-4334-8419-0babcf825ef3",
          "4e6a26c0-fa1a-49fb-94b1-0f50aa1bfcc8",
          "9ce26cab-43c4-4b42-be7e-1c69abb2c421",
          "422f4a69-35fd-43de-b1bd-21b0b20d8c49",
          "30a946b8-d538-4b5e-8087-236007c86045",
          "102c291b-e42a-49e4-97cd-354bbaca3544"
        ]
    appsName:
        [
          "manager-for-gphotos-pro",
          "gclient-for-google-photos-pro",
          "studio-photo-collage",
          "screen-shot-tool",
          "jack-for-pdf",
          "templates-for-contract",
          "cvs-resume-templates",
          "word-files-editor",
          "editor-for-excel-files",
          "messenger-for-google-hangouts-pro",
          "rar-zip-extractor-pro"
        ]
  processor: "./tool.js"
scenarios:
  - flow:
    - get:
        url: "/"
    - get:
        url: "/help"
    - get:
        url: "/aboutus"
    - get:
        url: "/privacypolicy"
    - loop:
          - log: "Element!"
          - get:
              url: "/store/downloadapplicationinstaller?applicationId={{ $loopElement }}"
      over: appsId
    - loop:
          - get:
              url: "/store/details/{{ $loopElement }}"
          - get:
              url: "/images/uploaded/{{ $loopElement }}/screens/0.jpg"
          - get:
              url: "/images/uploaded/{{ $loopElement }}/screens/1.jpg"
          - get:
              url: "/images/uploaded/{{ $loopElement }}/screens/2.jpg"
          - get:
              url: "/images/uploaded/{{ $loopElement }}/screens/3.jpg"
      over: appsName